#print( 20+200 )
#print( '안녕하세요' )
#print  괄호 안의 내용을 출력하는 기능
print( 100 ); print( 2000 )
'''
* ESCAPE 문자
 - 문자열 안에서 특수한 동작을 해 주는 것
  \n	: 엔터값과 비슷함
  \t	: tab 크기만큼 커서를 오른쪽으로 이동
  \"	: "(큰 따옴표) 출력
  \'	: '(작은 따옴표) 출력 
'''

#print( "안\n녕\n하\n세\n요\n" )
#print("Have\t a\t good\t time")
#print("1234567\t1\t12345678\t55")

#print(" '안녕' '''''")
#print(" \"안녕\" ")

#print(' ""안녕"" ')
#print(' \'안녕\' ')

#print('C:\\')


print( "\t #### 회비 정보 ####" )
print( "===========================================" )
print( "이름\t 나이\t 전화번호\t 회비" )
print( "===========================================" )
print( "홍길동\t \"15\"\t 010-123-1234\t \\20,000" )
print( "임꺽정\t \"20\"\t 010-234-2345\t \\30,000" )
print( "김말이\t \"28\"\t 010-345-3456\t \\50,000" )
print( "-------------------------------------------" )
print( "총합계\t\t\t\t \\100,000" )
print( "===========================================" )


print( "-" )


print( 123 + 123 )
print( 542 - 242 )
print( 2 * 123 )
print( 120 / 3 )

print( "안녕", 123+100 )
print( "10" + "100" )
print( "안녕" + "하세요" )

print( "-" )

print( "12 + 54 =", 12 + 54, "입니다" )
print( "268 - 42 =", 268 - 42, "입니다" )
print( "2 * 23 =", 2 * 23, "입니다" )
print( "120 / 3 =", 120 / 3, "입니다" )


































